"""
7.	Реализуйте структуру данных «Множество» на основе такой структуры данных, как «Динамический массив».
Обращение к элементам множества должно производиться с использованием дандерных (магических) методов Python.
Также реализуйте 2 варианта проверки вхождения элемента в структуру данных,
метод intersect для выполнения такой операции над множествами, как пересечение
и метод union для выполнения такой операции над множествами, как объединение.

11.	Реализуйте структуру данных «Стек» и напишите функцию проверяющую корректность скобочной последовательности в строке,
состоящей из скобок следующего типа - (, {, [, ], }, ).
Необходимо проверить, является ли скобочная последовательность корректной,
то есть количество открывающих скобок равно количеству закрывающих,
и при этом на каждой позиции закрывающая скобка имеет соответствующую открывающую скобку.
"""

from MySet import *
from MyStack import *
from ValidateBrackets import *

if __name__ == "__main__":
    pass

